bench/results/10000_redis.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/rank_ab.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 25s max duration (incl. graceful stop):
              * rank_ab: 30 looping VUs for 20s (gracefulStop: 5s)


running (01.0s), 30/30 VUs, 2382 complete and 0 interrupted iterations
rank_ab   [   5% ] 30 VUs  01.0s/20s

running (02.0s), 30/30 VUs, 5274 complete and 0 interrupted iterations
rank_ab   [  10% ] 30 VUs  02.0s/20s

running (03.0s), 30/30 VUs, 8985 complete and 0 interrupted iterations
rank_ab   [  15% ] 30 VUs  03.0s/20s

running (04.0s), 30/30 VUs, 12988 complete and 0 interrupted iterations
rank_ab   [  20% ] 30 VUs  04.0s/20s

running (05.0s), 30/30 VUs, 17932 complete and 0 interrupted iterations
rank_ab   [  25% ] 30 VUs  05.0s/20s

running (06.0s), 30/30 VUs, 24237 complete and 0 interrupted iterations
rank_ab   [  30% ] 30 VUs  06.0s/20s

running (07.0s), 30/30 VUs, 29923 complete and 0 interrupted iterations
rank_ab   [  35% ] 30 VUs  07.0s/20s

running (08.0s), 30/30 VUs, 35035 complete and 0 interrupted iterations
rank_ab   [  40% ] 30 VUs  08.0s/20s

running (09.0s), 30/30 VUs, 40421 complete and 0 interrupted iterations
rank_ab   [  45% ] 30 VUs  09.0s/20s

running (10.0s), 30/30 VUs, 43965 complete and 0 interrupted iterations
rank_ab   [  50% ] 30 VUs  10.0s/20s

running (11.0s), 30/30 VUs, 48970 complete and 0 interrupted iterations
rank_ab   [  55% ] 30 VUs  11.0s/20s

running (12.0s), 30/30 VUs, 53286 complete and 0 interrupted iterations
rank_ab   [  60% ] 30 VUs  12.0s/20s

running (13.0s), 30/30 VUs, 57332 complete and 0 interrupted iterations
rank_ab   [  65% ] 30 VUs  13.0s/20s

running (14.0s), 30/30 VUs, 62256 complete and 0 interrupted iterations
rank_ab   [  70% ] 30 VUs  14.0s/20s

running (15.0s), 30/30 VUs, 67301 complete and 0 interrupted iterations
rank_ab   [  75% ] 30 VUs  15.0s/20s

running (16.0s), 30/30 VUs, 73066 complete and 0 interrupted iterations
rank_ab   [  80% ] 30 VUs  16.0s/20s

running (17.0s), 30/30 VUs, 80364 complete and 0 interrupted iterations
rank_ab   [  85% ] 30 VUs  17.0s/20s

running (18.0s), 30/30 VUs, 86842 complete and 0 interrupted iterations
rank_ab   [  90% ] 30 VUs  18.0s/20s

running (19.0s), 30/30 VUs, 93832 complete and 0 interrupted iterations
rank_ab   [  95% ] 30 VUs  19.0s/20s

running (20.0s), 30/30 VUs, 99932 complete and 0 interrupted iterations
rank_ab   [ 100% ] 30 VUs  20.0s/20s


  █ TOTAL RESULTS 

    checks_total.......: 100035  5001.096607/s
    checks_succeeded...: 100.00% 100035 out of 100035
    checks_failed......: 0.00%   0 out of 100035

    ✓ top30 200
    ✓ user_rank 200

    CUSTOM
    top30_latency..................: avg=5ms    min=740µs   med=3.99ms max=130.71ms p(90)=8.53ms  p(95)=10.98ms
    user_rank_latency..............: avg=7.67ms min=1.12ms  med=6.1ms  max=126.22ms p(90)=13.44ms p(95)=17.52ms

    HTTP
    http_req_duration..............: avg=5.81ms min=740µs   med=4.55ms max=130.71ms p(90)=10.16ms p(95)=13.36ms
      { expected_response:true }...: avg=5.81ms min=740µs   med=4.55ms max=130.71ms p(90)=10.16ms p(95)=13.36ms
    http_req_failed................: 0.00%  0 out of 100035
    http_reqs......................: 100035 5001.096607/s

    EXECUTION
    iteration_duration.............: avg=5.97ms min=785.5µs med=4.68ms max=130.79ms p(90)=10.37ms p(95)=13.64ms
    iterations.....................: 100035 5001.096607/s
    vus............................: 30     min=30          max=30
    vus_max........................: 30     min=30          max=30

    NETWORK
    data_received..................: 125 MB 6.2 MB/s
    data_sent......................: 7.9 MB 397 kB/s



running (20.0s), 00/30 VUs, 100035 complete and 0 interrupted iterations
rank_ab ✓ [ 100% ] 30 VUs  20s